tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Download with resuming and segmented downloading
brew "aria2"
# General-purpose data compression with high compression ratio
brew "xz"
# Shell extension to jump to frequently used directories
brew "autojump"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Informative, fancy bash prompt for Git users
brew "bash-git-prompt"
# GNU binary tools for native development
brew "binutils", link: true
# Searches a binary image for embedded files and executable code
brew "binwalk"
# CloudFlare's PKI toolkit
brew "cfssl"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils", link: false
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Classic UNIX line editor
brew "ed", link: true
# GNU multiple precision arithmetic library
brew "gmp"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Compression/decompression library aiming for high speed
brew "snappy"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which", args: ["with-default-names"]
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Go programming environment (1.12)
brew "go@1.12"
# Version Control Visualization Tool
brew "gource"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Reliable, high performance TCP/HTTP load balancer
brew "haproxy"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Powerful, lightweight programming language
brew "lua"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Platform built on V8 to build network applications
brew "node"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Emulator for x86 and PowerPC
brew "qemu"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Compressed read-only file system for Linux
brew "squashfs"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "balenaetcher"
cask "diffmerge"
cask "itsycal"
cask "java"
cask "keka"
cask "macdown"
cask "microsoft-remote-desktop-beta"
cask "mounty"
cask "prince"
cask "sequel-pro"
cask "spectacle"
cask "sqlitestudio"
cask "syncthing-app"
cask "webpquicklook"
cask "xquartz"
