tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Shell extension to jump to frequently used directories
brew "autojump"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Informative, fancy bash prompt for Git users
brew "bash-git-prompt"
# FSF/GNU ld, ar, readelf, etc. for native development
brew "binutils"
# CloudFlare's PKI toolkit
brew "cfssl"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Go dependency management tool
brew "dep"
# Classic UNIX line editor
brew "ed", args: ["with-default-names"]
# Collection of GNU find, xargs, and locate
brew "findutils", args: ["with-default-names"]
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU awk utility
brew "gawk"
# Git extension for versioning large files
brew "git-lfs"
# C code prettifier
brew "gnu-indent", args: ["with-default-names"]
# GNU implementation of the famous stream editor
brew "gnu-sed", args: ["with-default-names"]
# GNU version of the tar archiving utility
brew "gnu-tar", args: ["with-default-names"]
# GNU implementation of which utility
brew "gnu-which", args: ["with-default-names"]
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep", args: ["with-default-names"]
# Popular GNU data compression program
brew "gzip"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# The Kubernetes package manager
brew "kubernetes-helm"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Powerful, lightweight programming language
brew "lua"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# GUI for vim, made for macOS
brew "macvim"
# Open source relational database management system
brew "mysql", link: false
# Open source relational database management system
brew "mysql-client"
# MySQL database connector for C applications
brew "mysql-connector-c"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Persistent key-value database, with built-in net interface
brew "redis"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "diffmerge"
cask "docker"
cask "iina"
cask "keka"
cask "macdown"
cask "meld"
cask "mounty"
cask "prince"
cask "spectacle"
cask "syncthing-app"
cask "vagrant"
cask "xquartz"
